MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120F6TA/mcu.h
/*  Bit definition for CMU_CKSWR register  */
#define CMU_CKSWR_CKSW                                 (0x03U)
#define CMU_CKSWR_CKSW_0                               (0x01U)
#define CMU_CKSWR_CKSW_1                               (0x02U)

/*  Bit definition for CMU_XTALCR register  */
#define CMU_XTALCR_XTALSTP                             (0x01U)

/*  Bit definition for CMU_XTALCFGR register  */
#define CMU_XTALCFGR_XTALDRV_POS                       (4U)
#define CMU_XTALCFGR_XTALDRV                           (0x30U)
#define CMU_XTALCFGR_XTALDRV_0                         (0x10U)
#define CMU_XTALCFGR_XTALDRV_1                         (0x20U)
#define CMU_XTALCFGR_XTALMS_POS                        (6U)
#define CMU_XTALCFGR_XTALMS                            (0x40U)
#define CMU_XTALCFGR_SUPDRV_POS                        (7U)
#define CMU_XTALCFGR_SUPDRV                            (0x80U)

/*  Bit definition for CMU_XTALSTBCR register  */
#define CMU_XTALSTBCR_XTALSTB                          (0x07U)
#define CMU_XTALSTBCR_XTALSTB_0                        (0x01U)
#define CMU_XTALSTBCR_XTALSTB_1                        (0x02U)
#define CMU_XTALSTBCR_XTALSTB_2                        (0x04U)

/*  Bit definition for CMU_HRCCR register  */
#define CMU_HRCCR_HRCSTP                               (0x01U)

/*  Bit definition for CMU_OSCSTBSR register  */
#define CMU_OSCSTBSR_HRCSTBF_POS                       (0U)
#define CMU_OSCSTBSR_HRCSTBF                           (0x01U)
#define CMU_OSCSTBSR_XTALSTBF_POS                      (3U)
#define CMU_OSCSTBSR_XTALSTBF                          (0x08U)

/*  Bit definition for CMU_MCOCFGR register  */
#define CMU_MCOCFGR_MCOSEL_POS                         (0U)
#define CMU_MCOCFGR_MCOSEL                             (0x0FU)
#define CMU_MCOCFGR_MCODIV_POS                         (4U)
#define CMU_MCOCFGR_MCODIV                             (0x70U)
#define CMU_MCOCFGR_MCOEN_POS                          (7U)
#define CMU_MCOCFGR_MCOEN                              (0x80U)

/*  Bit definition for CMU_XTALSTDCR register  */
#define CMU_XTALSTDCR_XTALSTDIE_POS                    (0U)
#define CMU_XTALSTDCR_XTALSTDIE                        (0x01U)
#define CMU_XTALSTDCR_XTALSTDRE_POS                    (1U)
#define CMU_XTALSTDCR_XTALSTDRE                        (0x02U)
#define CMU_XTALSTDCR_XTALSTDRIS_POS                   (2U)
#define CMU_XTALSTDCR_XTALSTDRIS                       (0x04U)
#define CMU_XTALSTDCR_XTALSTDE_POS                     (7U)
#define CMU_XTALSTDCR_XTALSTDE                         (0x80U)

/*  Bit definition for CMU_FCG register  */
#define CMU_FCG_ADC_POS                                (0U)
#define CMU_FCG_ADC                                    (0x00000001UL)
#define CMU_FCG_CTC_POS                                (1U)
#define CMU_FCG_CTC                                    (0x00000002UL)
#define CMU_FCG_AOS_POS                                (4U)
#define CMU_FCG_AOS                                    (0x00000010UL)
#define CMU_FCG_CRC_POS                                (7U)
#define CMU_FCG_CRC                                    (0x00000080UL)
#define CMU_FCG_TMRB1_POS                              (8U)
#define CMU_FCG_TMRB1                                  (0x00000100UL)
#define CMU_FCG_TMRB2_POS                              (9U)
#define CMU_FCG_TMRB2                                  (0x00000200UL)
#define CMU_FCG_TMRB3_POS                              (10U)
#define CMU_FCG_TMRB3                                  (0x00000400UL)
#define CMU_FCG_TMRB4_POS                              (11U)
#define CMU_FCG_TMRB4                                  (0x00000800UL)
#define CMU_FCG_TMRB5_POS                              (12U)
#define CMU_FCG_TMRB5                                  (0x00001000UL)
#define CMU_FCG_TMRB6_POS                              (13U)
#define CMU_FCG_TMRB6                                  (0x00002000UL)
#define CMU_FCG_TMRB7_POS                              (14U)
#define CMU_FCG_TMRB7                                  (0x00004000UL)
#define CMU_FCG_TMRB8_POS                              (15U)
#define CMU_FCG_TMRB8                                  (0x00008000UL)
#define CMU_FCG_TMR0_POS                               (16U)
#define CMU_FCG_TMR0                                   (0x00010000UL)
#define CMU_FCG_UART1_POS                              (24U)
#define CMU_FCG_UART1                                  (0x01000000UL)
#define CMU_FCG_UART2_POS                              (25U)
#define CMU_FCG_UART2                                  (0x02000000UL)
#define CMU_FCG_UART3_POS                              (26U)
#define CMU_FCG_UART3                                  (0x04000000UL)
#define CMU_FCG_UART4_POS                              (27U)
#define CMU_FCG_UART4                                  (0x08000000UL)
#define CMU_FCG_I2C_POS                                (28U)
#define CMU_FCG_I2C                                    (0x10000000UL)
#define CMU_FCG_SPI_POS                                (29U)
#define CMU_FCG_SPI                                    (0x20000000UL)

/*  Bit definition for CMU_LRCCR register  */
#define CMU_LRCCR_LRCSTP                               (0x01U)

/*******************************************************************************
                Bit definition for Peripheral CRC
*******************************************************************************/
/*  Bit definition for CRC_CR register  */
#define CRC_CR_CR_POS                                  (0U)
#define CRC_CR_CR                                      (0x00000001UL)
#define CRC_CR_FLAG_POS                                (1U)
#define CRC_CR_FLAG                                    (0x00000002UL)

/*  Bit definition for CRC_RESLT register  */
#define CRC_RESLT                                      (0xFFFFFFFFUL)

/*  Bit definition for CRC_DAT0 register  */
#define CRC_DAT0                                       (0xFFFFFFFFUL)

/*  Bit definition for CRC_DAT1 register  */
#define CRC_DAT1                                       (0xFFFFFFFFUL)

