MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F120F6TA/mcu.h
/*  Bit definition for GPIO_POER0 register  */
#define GPIO_POER0_POUTE0_POS                          (0U)
#define GPIO_POER0_POUTE0                              (0x01U)
#define GPIO_POER0_POUTE1_POS                          (1U)
#define GPIO_POER0_POUTE1                              (0x02U)

/*  Bit definition for GPIO_POER1 register  */
#define GPIO_POER1_POUTE0_POS                          (0U)
#define GPIO_POER1_POUTE0                              (0x01U)
#define GPIO_POER1_POUTE1_POS                          (1U)
#define GPIO_POER1_POUTE1                              (0x02U)
#define GPIO_POER1_POUTE2_POS                          (2U)
#define GPIO_POER1_POUTE2                              (0x04U)
#define GPIO_POER1_POUTE3_POS                          (3U)
#define GPIO_POER1_POUTE3                              (0x08U)
#define GPIO_POER1_POUTE4_POS                          (4U)
#define GPIO_POER1_POUTE4                              (0x10U)
#define GPIO_POER1_POUTE5_POS                          (5U)
#define GPIO_POER1_POUTE5                              (0x20U)
#define GPIO_POER1_POUTE6_POS                          (6U)
#define GPIO_POER1_POUTE6                              (0x40U)
#define GPIO_POER1_POUTE7_POS                          (7U)
#define GPIO_POER1_POUTE7                              (0x80U)

/*  Bit definition for GPIO_POER2 register  */
#define GPIO_POER2_POUTE0_POS                          (0U)
#define GPIO_POER2_POUTE0                              (0x01U)
#define GPIO_POER2_POUTE1_POS                          (1U)
#define GPIO_POER2_POUTE1                              (0x02U)
#define GPIO_POER2_POUTE2_POS                          (2U)
#define GPIO_POER2_POUTE2                              (0x04U)
#define GPIO_POER2_POUTE3_POS                          (3U)
#define GPIO_POER2_POUTE3                              (0x08U)

/*  Bit definition for GPIO_POER3 register  */
#define GPIO_POER3_POUTE0_POS                          (0U)
#define GPIO_POER3_POUTE0                              (0x01U)
#define GPIO_POER3_POUTE1_POS                          (1U)
#define GPIO_POER3_POUTE1                              (0x02U)

/*  Bit definition for GPIO_POER4 register  */
#define GPIO_POER4_POUTE0                              (0x03U)

/*  Bit definition for GPIO_POER5 register  */
#define GPIO_POER5_POUTE0_POS                          (0U)
#define GPIO_POER5_POUTE0                              (0x01U)
#define GPIO_POER5_POUTE1_POS                          (1U)
#define GPIO_POER5_POUTE1                              (0x02U)

/*  Bit definition for GPIO_POER6 register  */
#define GPIO_POER6_POUTE0_POS                          (0U)
#define GPIO_POER6_POUTE0                              (0x01U)
#define GPIO_POER6_POUTE1_POS                          (1U)
#define GPIO_POER6_POUTE1                              (0x02U)
#define GPIO_POER6_POUTE2_POS                          (2U)
#define GPIO_POER6_POUTE2                              (0x04U)

/*  Bit definition for GPIO_POER7 register  */
#define GPIO_POER7_POUTE0                              (0x0FU)

/*  Bit definition for GPIO_POER12 register  */
#define GPIO_POER12_POUTE0_POS                         (0U)
#define GPIO_POER12_POUTE0                             (0x01U)
#define GPIO_POER12_POUTE1_POS                         (1U)
#define GPIO_POER12_POUTE1                             (0x02U)
#define GPIO_POER12_POUTE2_POS                         (2U)
#define GPIO_POER12_POUTE2                             (0x04U)

/*  Bit definition for GPIO_POER13 register  */
#define GPIO_POER13_POUTE7_POS                         (7U)
#define GPIO_POER13_POUTE7                             (0x80U)

/*  Bit definition for GPIO_POER14 register  */
#define GPIO_POER14_POUTE7_POS                         (7U)
#define GPIO_POER14_POUTE7                             (0xC0U)

/*  Bit definition for GPIO_POSR0 register  */
#define GPIO_POSR0_POS0_POS                            (0U)
#define GPIO_POSR0_POS0                                (0x01U)
#define GPIO_POSR0_POS1_POS                            (1U)
#define GPIO_POSR0_POS1                                (0x02U)

/*  Bit definition for GPIO_POSR1 register  */
#define GPIO_POSR1_POS0_POS                            (0U)
#define GPIO_POSR1_POS0                                (0x01U)
#define GPIO_POSR1_POS1_POS                            (1U)
#define GPIO_POSR1_POS1                                (0x02U)
#define GPIO_POSR1_POS2_POS                            (2U)
#define GPIO_POSR1_POS2                                (0x04U)
#define GPIO_POSR1_POS3_POS                            (3U)
#define GPIO_POSR1_POS3                                (0x08U)
#define GPIO_POSR1_POS4_POS                            (4U)
#define GPIO_POSR1_POS4                                (0x10U)
#define GPIO_POSR1_POS5_POS                            (5U)
#define GPIO_POSR1_POS5                                (0x20U)
#define GPIO_POSR1_POS6_POS                            (6U)
#define GPIO_POSR1_POS6                                (0x40U)
#define GPIO_POSR1_POS7_POS                            (7U)
#define GPIO_POSR1_POS7                                (0x80U)

/*  Bit definition for GPIO_POSR2 register  */
#define GPIO_POSR2_POS0_POS                            (0U)
#define GPIO_POSR2_POS0                                (0x01U)
#define GPIO_POSR2_POS1_POS                            (1U)
#define GPIO_POSR2_POS1                                (0x02U)
#define GPIO_POSR2_POS2_POS                            (2U)
#define GPIO_POSR2_POS2                                (0x04U)
#define GPIO_POSR2_POS3_POS                            (3U)
#define GPIO_POSR2_POS3                                (0x08U)

/*  Bit definition for GPIO_POSR3 register  */
#define GPIO_POSR3_POS0_POS                            (0U)
#define GPIO_POSR3_POS0                                (0x01U)
#define GPIO_POSR3_POS1_POS                            (1U)
#define GPIO_POSR3_POS1                                (0x02U)

/*  Bit definition for GPIO_POSR4 register  */
#define GPIO_POSR4_POS0                                (0x03U)

/*  Bit definition for GPIO_POSR5 register  */
#define GPIO_POSR5_POS0_POS                            (0U)
#define GPIO_POSR5_POS0                                (0x01U)
#define GPIO_POSR5_POS1_POS                            (1U)
#define GPIO_POSR5_POS1                                (0x02U)

